In [1]:
import os
import pandas as pd
import numpy as np
from pydataset import data
from env import get_connection

# Acquisition Exercises

## Part 1:

1. Make a new repo called classification-exercises on both GitHub and within your codeup-data-science directory. This will be where you do your work for this module.

In [2]:
#Done

2. Inside of your local classification-exercises repo, create a file named .gitignore with the following contents:

- env.py
- .DS_Store
- .ipynb_checkpoints/
- __pycache__
- *.csv

Add and commit your .gitignore file before moving forward.

In [3]:
#Done

3. Now that you are 100% sure that your .gitignore file lists env.py, create or copy your env.py file inside of classification-exercises. Running git status should show that git is ignoring this file.

In [4]:
#Done

4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [5]:
df_iris = data('iris')
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

- print the first 3 rows

In [6]:
#Seaborn has a slightly different structure:
print(df_iris[0:3])

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

- print the number of rows and columns (shape)

In [7]:
df_iris.shape

(150, 5)

- print the column names

In [8]:
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

- print the data type of each column

In [9]:
df_iris.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

- print the summary statistics for each of the numeric variables

In [10]:
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [11]:
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

5. Read the data from this google sheet into a dataframe, df_google.

In [12]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

In [13]:
#df_google = pd.read_csv(csv_export_url)
#df_google.head()
# Throwing an error "RemoteDisconnected: Remote end closed connection without response"

- print the first 3 rows

In [14]:
#print(df_google[0:3])

- print the number of rows and columns

In [15]:
#df_google.shape

- print the column names

In [16]:
#df_google.columns

- print the data type of each column

In [17]:
#df_google.dtypes

- print the summary statistics for each of the numeric variables

In [18]:
#df_google.describe()

- print the unique values for each of your categorical variables

In [19]:
"""
print("---------------------------------------------------------------")
print(df_google.Name.unique())
print("---------------------------------------------------------------")
print(df_google.Sex.unique())
print("---------------------------------------------------------------")
print(df_google.Ticket.unique())
print("---------------------------------------------------------------")
print(df_google.Cabin.unique())
print("---------------------------------------------------------------")
print(df_google.Embarked.unique())
print("---------------------------------------------------------------")
"""

'\nprint("---------------------------------------------------------------")\nprint(df_google.Name.unique())\nprint("---------------------------------------------------------------")\nprint(df_google.Sex.unique())\nprint("---------------------------------------------------------------")\nprint(df_google.Ticket.unique())\nprint("---------------------------------------------------------------")\nprint(df_google.Cabin.unique())\nprint("---------------------------------------------------------------")\nprint(df_google.Embarked.unique())\nprint("---------------------------------------------------------------")\n'

In [20]:
#df_google.nunique()

In [21]:
# You would have to do this for each column:
#df_google.Pclass.value_counts(dropna=False)

6. Download the previous exercise's file into an excel (File → Download → Microsoft Excel). Read the downloaded file into a dataframe named df_excel.

In [22]:
df_excel = pd.read_excel('train.xlsx', sheet_name='train')
df_excel.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

- assign the first 100 rows to a new dataframe, df_excel_sample

In [23]:
df_excel_sample = df_excel[0:100]
df_excel_sample.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
97,98,1,1,"Greenfield, Mr. William Bertram",male,23.0,0,1,PC 17759,63.3583,D10 D12,C
98,99,1,2,"Doling, Mrs. John T (Ada Julia Bone)",female,34.0,0,1,231919,23.0000,NaN,S
99,100,0,2,"Kantor, Mr. Sinai",male,34.0,1,0,244367,26.0000,NaN,S

- print the number of rows of your original dataframe

In [24]:
df_excel.shape[0]

891

- print the first 5 column names

In [25]:
df_excel.columns[0:5]

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

- print the column names that have a data type of object

In [26]:
df_object = df_excel.dtypes == 'object'
df_object[df_object == True]

Name        True
Sex         True
Ticket      True
Cabin       True
Embarked    True
dtype: bool

- compute the range for each of the numeric variables.

In [27]:
# You could use the df_excel.describe().T to flip the rows/columns.

In [28]:
df_range = df_excel.describe().loc['max'] - df_excel.describe().loc['min']
df_range

PassengerId    890.0000
Survived         1.0000
Pclass           2.0000
Age             79.5800
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

## Part 2:

Make a new python module, acquire.py to hold the following data aquisition functions:

1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [29]:
def get_titanic_data():
    
    """
    This function reads the titanic data from Codeup db into a df.
    """
    filename = "titanic.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [30]:
titanic_df = get_titanic_data()

In [31]:
titanic_df.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [32]:
def get_iris_data():
    """
    This function reads the iris data from Codeup db into a df.
    """
    filename = "iris.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        query = """
        SELECT sepal_length, sepal_width, petal_length, petal_width, species_name, species_id FROM measurements
        LEFT JOIN species USING (species_id);
        """
        # read the SQL query into a dataframe
        df = pd.read_sql(query, get_connection('iris_db'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [33]:
iris_df = get_iris_data()
iris_df.head()

,sepal_length,sepal_width,petal_length,petal_width,species_name,species_id
0,5.1,3.5,1.4,0.2,setosa,1
1,4.9,3.0,1.4,0.2,setosa,1
2,4.7,3.2,1.3,0.2,setosa,1
3,4.6,3.1,1.5,0.2,setosa,1
4,5.0,3.6,1.4,0.2,setosa,1

3. Make a function named get_telco_data that returns the data from the telco_churn database in SQL. In your SQL, be sure to join contract_types, internet_service_types, payment_types tables with the customers table, so that the resulting dataframe contains all the contract, payment, and internet service options. Obtain your data from the Codeup Data Science Database.

In [34]:
def get_telco_data():
    """
    This function reads the telco_churn data from Codeup db into a df.
    """
    filename = "telco_churn.csv"
    
    if os.path.isfile(filename):
        return pd.read_csv(filename)
    else:
        # read the SQL query into a dataframe
        query = """
        SELECT * FROM customers 
        LEFT JOIN contract_types USING (contract_type_id)
        LEFT JOIN internet_service_types USING (internet_service_type_id)
        LEFT JOIN payment_types USING (payment_type_id);
        """
        df = pd.read_sql(query, get_connection('telco_churn'))
        
        # Write that dataframe to disk for later. Called "caching" the data for later.
        df.to_csv(filename)
        
        # Return the dataframe to the calling code
        return df

In [35]:
telco_df = get_telco_data()

In [36]:
telco_df.head()

,Unnamed: 0,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,1,2,1,1,0003-MKNFE,Male,0,No,No,9,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,2,1,2,1,0004-TLHLJ,Male,0,No,No,4,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

4. Once you've got your get_titanic_data, get_iris_data, and get_telco_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for the local filename of telco.csv, titanic.csv, or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [37]:
# Done

# Preparation Exercises

In [38]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# import splitting and imputing functions
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# turn off pink boxes for demo
import warnings
warnings.filterwarnings("ignore")

# import our own acquire module
import acquire

Using the Iris Data:

1. Use the function defined in acquire.py to load the iris data.

In [39]:
iris = acquire.get_iris_data()

In [40]:
iris.head()

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species_name,species_id
0,0,5.1,3.5,1.4,0.2,setosa,1
1,1,4.9,3.0,1.4,0.2,setosa,1
2,2,4.7,3.2,1.3,0.2,setosa,1
3,3,4.6,3.1,1.5,0.2,setosa,1
4,4,5.0,3.6,1.4,0.2,setosa,1

2. Drop the species_id and measurement_id columns.

In [41]:
cols_to_drop = ['species_id'] #Never imported the measurements_id column

In [43]:
iris = iris.drop(columns=cols_to_drop)

In [44]:
iris.columns

Index(['Unnamed: 0', 'sepal_length', 'sepal_width', 'petal_length',
       'petal_width', 'species_name'],
      dtype='object')

3. Rename the species_name column to just species.

In [48]:
iris.rename(columns={'species_name':'species'}, inplace=True)

4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [51]:
dummy_df = pd.get_dummies(iris[['species']], drop_first=True)

In [52]:
dummy_df.sample(5)

     species_versicolor  species_virginica
30                    0                  0
81                    1                  0
105                   0                  1
113                   0                  1
94                    1                  0

In [53]:
iris = pd.concat([iris, dummy_df], axis=1)

In [55]:
iris.sample(5)

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
53,53,5.5,2.3,4.0,1.3,versicolor,1,0
129,129,7.2,3.0,5.8,1.6,virginica,0,1
1,1,4.9,3.0,1.4,0.2,setosa,0,0
81,81,5.5,2.4,3.7,1.0,versicolor,1,0
108,108,6.7,2.5,5.8,1.8,virginica,0,1

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [56]:
def prep_iris(df):
    """ 
    This function takes a dataframe from the iris dataset 
    containing the sepal_length, sepal_width, petal_length, 
    petal_width, species_name, species_id columns and returns 
    a cleaner dataset.
    """
    #Assigns column to a list and drops species_id:
    cols_to_drop = ['species_id'] #Never imported the measurements_id column
    df = df.drop(columns=cols_to_drop)
    
    #Shortens the species column name:
    df.rename(columns={'species_name':'species'}, inplace=True)
    
    #Assigns two dummy columns and attach them to the dataframe.
    dummy_df = pd.get_dummies(df[['species']], drop_first=True)
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [58]:
iris_test = acquire.get_iris_data()
iris_test = prep_iris(iris_test)

In [59]:
iris_test.sample(5)

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species,species_versicolor,species_virginica
35,35,5.0,3.2,1.2,0.2,setosa,0,0
29,29,4.7,3.2,1.6,0.2,setosa,0,0
76,76,6.8,2.8,4.8,1.4,versicolor,1,0
94,94,5.6,2.7,4.2,1.3,versicolor,1,0
124,124,6.7,3.3,5.7,2.1,virginica,0,1

Using the Titanic dataset

1. Use the function defined in acquire.py to load the Titanic data.

2. Drop any unnecessary, unhelpful, or duplicated columns.

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

Using the Telco dataset

1. Use the function defined in acquire.py to load the Telco data.

2. Drop any unnecessary, unhelpful, or duplicated columns. This could mean dropping foreign key columns but keeping the corresponding string values, for example.

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

4. Create a function named prep_telco that accepts the raw telco data, and returns the data with the transformations above applied.

Split your data

1. Write a function to split your data into train, test and validate datasets. Add this function to prepare.py.

2. Run the function in your notebook on the Iris dataset, returning 3 datasets, train_iris, validate_iris and test_iris.

3. Run the function on the Titanic dataset, returning 3 datasets, train_titanic, validate_titanic and test_titanic.

4. Run the function on the Telco dataset, returning 3 datasets, train_telco, validate_telco and test_telco.